app/controllers/api/v1/interviews_controller.rb

			def index
				interviews = Interview.all
---
SELECT "interviews".* FROM "interviews"

			def show
				interview = Interview.find(params[:id])
---
SELECT "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

			def update
				interview = Interview.find(params[:id])
				if interview.update_attributes(interview_params)
---
SELECT "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "interviews" SET "topic" = ?, "schedule_at" = ?, "end_time" = ?, "meet_link" = ?, "updated_at" = ? WHERE "interviews"."id" = ?  [["topic", "SqwertghDE"], ["schedule_at", "1994-05-28 04:04:04"], ["end_time", "1994-05-28 06:06:04"], ["meet_link", "vdzxxdvdv.com"], ["updated_at", "2020-05-29 14:46:44.446453"], ["id", 10]]

			def create
				interview = Interview.new(interview_params)
				if interview.save
---
INSERT INTO "interviews" ("topic", "role", "user_id", "schedule_at", "meet_link", "created_at", "updated_at", "user_name", "end_time") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

			def destroy
				interview = Interview.find(params[:id])
				interview.destroy
---
SELECT "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "interviews" WHERE "interviews"."id" = ?  [["id", 22]]